import React from 'react'
export default class UserProtocal extends React.Component{
    render(){
        return <div>
            <h2 className='help-title'>
                服务协议
            </h2>
            <div className='help-item'>
                <h4 className='help-item-title'>《碧桂园纳税申报系统协议》</h4>
                <p>
                本服务条款是您与同城互助信息服务平台(包含同城互助网站、同城互助手机终端软件)的所有者-----科技有限公司及其关联公司之间就同城互助提供的信息服务等相关事宜所订立的合约或合同。请您仔细阅读本条款,您勾选"我已了解并接受《注册服务条款》"并点击【立即注册】按钮注册成功后成为同城互助的正式会员,本服务条款即构成了对双方具有法律约束力的文件。
                碧桂园纳税申报系统协议
                本服务条款是您与同城互助信息服务平台(包含同城互助网站、同城互助手机终端软件)的所有者-----科技有限公司及其关联公司之间就同城互助提供的信息服务等相关事宜所订立的合约或合同。
                请您仔细阅读本条款,您勾选"我已了解并接受《注册服务条款》"并点击【立即注册】按钮注册成功后成为同城互助的正式会员,本服务条款即构成了对双方具有法律约束力的文件。
                <br/>一、定义
                同城互助信息服务平台,为提供及维护信息发布的服务平台。其为平台注册用户(信息发布方和接收方)免费提供信息中介管理服务,为用户发布和搜索帮助信息提供便利与支持。
                用户,包含注册用户和非注册用户。注册用户是指通过同城互助移动端APP 完成全部注册程序后,使用同城互助平台服务的用户。非注册用户是指未进行注册、直接登录同城互助移动端APP使用同城互助平台服务的用户。
                信息发布方,是指在同城互助信息服务平台上创建、发布帮助信息的平台注册用户。
                信息接受方,是指在同城互助信息服务平台上浏览、搜索已发布的帮助信息寻求帮助者。
                <br/>二、协议的效力
                <br/>1、在您按照注册页面提示填写信息、阅读并同意本协议并完成全部注册程序后或以其他同城互助允许的方式实际使用同城互助平台服务时,您即受本协议的约束。在注册时,您应当按照法律法规要求,或注册页面的提示,准确填写并及时更新您提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式,以便同城互助或其他会员与您进行有效联系。如您的资料发生变更,您应及时更新您的资料,以使之真实、及时,完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的,同城互助有权向您发出询问及/或要求改正的通知,并有权直接做出删除相应资料的处理,直至中止、终止对您提供部分或全部服务。由此导致您在使用同城互助平台服务过程中产生任何损失或增加费用的,应由您完全独自承担。
                <br/>2、对于您提供的资料及数据信息,您授予同城互助独家的、全球通用的、永久的、免费的许可使用权利。您同意,同城互助有权(全部或部分地) 使用、复制、更正、发布、翻译、分发、执行和展示您的资料数据(包括但不限于注册资料、行为数据及全部展示于同城互助平台的各类信息)或制作其派生作品,并以现在已知或日后开发的任何形式、媒体或技术,将上述信息纳入其它作品内。
                在此,您特别做出授权,允许同城互助依据您提供的信息资料及在同城互助平台上的行为、投诉及侵权状况等进行信用评级,您对同城互助的信用评级体系予以认可并同意同城互助将您在平台存储的全部或部分信息及信用评价结果以有偿或无偿方式提供给第三方进行商业或非商业方式的使用,而无需在该提供行为之前再另行取得您的同意。如您不同意做出前述授权,您应立即停止注册程序或停止使用同城互助平台服务。如您继续使用同城互助平台服务的,即表示您同意做出前述授权。
                </p>
            </div>
        </div>
    }
}