import { generateRows } from './sheetUtils'

export default [
    [
        { value: '项目', readOnly: true },
        { value: '栏次', readOnly: true },
        { value: '金额', readOnly: true },
        { value: '税额', readOnly: true },
    ],
    [
        { value: '一、按税率或征收率归集（不包括购建不动产、通行费）的进项', readOnly: true, colSpan: 4 }
    ],
    ...generateRows([
        '17%税率的进项',
        '其中：有形动产租赁的进项',
        '13%税率的进项',
        '11%税率的进项',
        '其中：运输服务的进项',
        '电信服务的进项',
        '建筑安装服务的进项',
        '不动产租赁服务的进项',
        '受让土地使用权的进项',
        '6%税率的进项',
        '其中：电信服务的进项',
        '金融保险服务的进项',
        '生活服务的进项',
        '取得无形资产的进项',
        '5%征收率的进项',
        '其中：不动产租赁服务的进项',
        '3%征收率的进项',
        '其中：货物及加工、修理修配劳务的进项',
        '运输服务的进项',
        '电信服务的进项',
        '建筑安装服务的进项',
        '金融保险服务的进项',
        '有形动产租赁服务的进项',
        '生活服务的进项',
        '取得无形资产的进项',
        '减按1.5%征收率的进项'], 2, 'B', 1),
    [
        { value: '二、按抵扣项目归集的进项', readOnly: true, colSpan: 4 }
    ],
    ...generateRows([
        '用于购建不动产并一次性抵扣的进项',
        '通行费的进项',
        '后面没字母了怎么办？？？？？？？？？？？？？'], 2, 'A', 27),
    [
        { value: '合计', readOnly: true },
        { key: 'A1' },
        { key: 'A2' },
        { key: 'A3' },
    ],
];